apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_tim_v3.h
/****************************************************************************
 * arch/arm/src/common/stm32/hardware/stm32_tim_v3.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_TIM_V3_H
#define __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_TIM_V3_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

/* BTIM: Basic Timers - TIM6 and TIM7 */

#define STM32_BTIM_CR1_OFFSET      0x0000  /* Control register 1 (16-bit) */
#define STM32_BTIM_CR2_OFFSET      0x0004  /* Control register 2 (16-bit) */
#define STM32_BTIM_DIER_OFFSET     0x000c  /* DMA/Interrupt enable register (16-bit) */
#define STM32_BTIM_SR_OFFSET       0x0010  /* Status register (16-bit) */
#define STM32_BTIM_EGR_OFFSET      0x0014  /* Event generation register (16-bit) */
#define STM32_BTIM_CNT_OFFSET      0x0024  /* Counter (32-bit register, 16-bit counter) */
#define STM32_BTIM_PSC_OFFSET      0x0028  /* Prescaler (16-bit) */
#define STM32_BTIM_ARR_OFFSET      0x002c  /* Auto-reload register (32-bit) */

/* GTIM: General Timers
 * 16-/32-bit General Timers with DMA: TIM2, TM3, TIM4, and TIM5
 * 16-bit General Timers with DMA: TIM15, TIM16, and TIM17
 *
 * Caution! TIM2/5, TIM3/4, TIM15, and TIM16/17 are slightly different and
 * have different registers, register sizes, and register bitfields!
 *
 * Some registers are marked with the following notes:
 *
 * Note 1: The register is 32-bit but its contents have different variants
 *         for TIM3/4 and TIM2/5, TIM15
 * Note 2: This register not available on TIM15
 * Note 3: This register not available on TIM16/17
 */

#define STM32_GTIM_CR1_OFFSET      0x0000  /* Control register 1 (16-bit) */
#define STM32_GTIM_CR2_OFFSET      0x0004  /* Control register 2 (32-bit TIM2-5; 16-bit TIM15-17) */
#define STM32_GTIM_SMCR_OFFSET     0x0008  /* Slave mode control register (32-bit TIM2-5, TIM15, See Note 3) */
#define STM32_GTIM_DIER_OFFSET     0x000c  /* DMA/Interrupt enable register (32-bit TIM2-5; 16-bit TIM15) */
#define STM32_GTIM_SR_OFFSET       0x0010  /* Status register (32-bit TIM2-5; 16-bit TIM15-17) */
#define STM32_GTIM_EGR_OFFSET      0x0014  /* Event generation register (16-bit) */
#define STM32_GTIM_CCMR1_OFFSET    0x0018  /* Capture/compare mode register 1 (32-bit) */
#define STM32_GTIM_CCMR2_OFFSET    0x001c  /* Capture/compare mode register 2 (32-bit) */
#define STM32_GTIM_CCER_OFFSET     0x0020  /* Capture/compare enable register (16-bit) */
#define STM32_GTIM_CNT_OFFSET      0x0024  /* Counter (32-bit, See Note 1) */
#define STM32_GTIM_PSC_OFFSET      0x0028  /* Prescaler (16-bit) */
#define STM32_GTIM_ARR_OFFSET      0x002c  /* Auto-reload register (32-bit, See Note 1) */
#define STM32_GTIM_RCR_OFFSET      0x0030  /* Repetition counter register (16-bit, TIM15 only) */
#define STM32_GTIM_CCR1_OFFSET     0x0034  /* Capture/compare register 1 (32-bit, See Note 1) */
#define STM32_GTIM_CCR2_OFFSET     0x0038  /* Capture/compare register 2 (32-bit, See Notes 1, 3) */
#define STM32_GTIM_CCR3_OFFSET     0x003c  /* Capture/compare register 3 (32-bit, See Notes 1, 3) */
#define STM32_GTIM_CCR4_OFFSET     0x0040  /* Capture/compare register 4 (32-bit, See Notes 1, 3) */
#define STM32_GTIM_BDTR_OFFSET     0x0044  /* Break and dead-time register (32-bit, TIM15-17 only) */
#define STM32_GTIM_OR1_OFFSET      0x0050  /* Option register 1 (TIM16/17 only) */
#define STM32_GTIM_DTR2_OFFSET     0x0054  /* Dead-time register 2 (32-bit, TIM15-17 only) */
#define STM32_GTIM_ECR_OFFSET      0x0058  /* Encoder control register (32-bit, See Notes 2, 3) */
#define STM32_GTIM_TISEL_OFFSET    0x005c  /* Timer input selection register (32-bit) */
#define STM32_GTIM_AF1_OFFSET      0x0060  /* Alternate function option register 1 (32-bit) */
#define STM32_GTIM_AF2_OFFSET      0x0064  /* Alternate function option register 2 (32-bit) */
#define STM32_GTIM_DCR_OFFSET      0x03dc  /* DMA control register (16-bit, TIM2-5 only) */
#define STM32_GTIM_DMAR_OFFSET     0x03e0  /* DMA address for burst mode (16-bit, TIM2-5 only) */

/* ATIM: Advanced Timers - TIM1, TIM8, and TIM20 */

#define STM32_ATIM_CR1_OFFSET      0x0000  /* Control register 1 (16-bit) */
#define STM32_ATIM_CR2_OFFSET      0x0004  /* Control register 2 (32-bit) */
#define STM32_ATIM_SMCR_OFFSET     0x0008  /* Slave mode control register (32-bit) */
#define STM32_ATIM_DIER_OFFSET     0x000c  /* DMA/Interrupt enable register (32-bit) */
#define STM32_ATIM_SR_OFFSET       0x0010  /* Status register (32-bit) */
#define STM32_ATIM_EGR_OFFSET      0x0014  /* Event generation register (16-bit) */
#define STM32_ATIM_CCMR1_OFFSET    0x0018  /* Capture/compare mode register 1 (32-bit) */
#define STM32_ATIM_CCMR2_OFFSET    0x001c  /* Capture/compare mode register 2 (32-bit) */
#define STM32_ATIM_CCER_OFFSET     0x0020  /* Capture/compare enable register (32-bit) */
#define STM32_ATIM_CNT_OFFSET      0x0024  /* Counter (32-bit register, 16-bit counter) */
#define STM32_ATIM_PSC_OFFSET      0x0028  /* Prescaler (16-bit) */
#define STM32_ATIM_ARR_OFFSET      0x002c  /* Auto-reload register (32-bit) */
#define STM32_ATIM_RCR_OFFSET      0x0030  /* Repetition counter register (16-bit) */
#define STM32_ATIM_CCR1_OFFSET     0x0034  /* Capture/compare register 1 (32-bit) */
#define STM32_ATIM_CCR2_OFFSET     0x0038  /* Capture/compare register 2 (32-bit) */
#define STM32_ATIM_CCR3_OFFSET     0x003c  /* Capture/compare register 3 (32-bit) */
#define STM32_ATIM_CCR4_OFFSET     0x0040  /* Capture/compare register 4 (32-bit) */
#define STM32_ATIM_BDTR_OFFSET     0x0044  /* Break and dead-time register (32-bit) */
#define STM32_ATIM_CCR5_OFFSET     0x0048  /* Capture/compare register 5 (32-bit) */
#define STM32_ATIM_CCR6_OFFSET     0x004c  /* Capture/compare register 6 (32-bit) */
#define STM32_ATIM_CCMR3_OFFSET    0x0050  /* Capture/compare mode register 3 (32-bit) */
#define STM32_ATIM_DTR2_OFFSET     0x0054  /* Dead-time register 2 (32-bit) */
#define STM32_ATIM_ECR_OFFSET      0x0058  /* Encoder control register (32-bit) */
#define STM32_ATIM_TISEL_OFFSET    0x005c  /* Timer input selection register (32-bit) */
#define STM32_ATIM_AF1_OFFSET      0x0060  /* Alternate function option register 1 (32-bit) */
#define STM32_ATIM_AF2_OFFSET      0x0064  /* Alternate function option register 2 (32-bit) */
#define STM32_ATIM_DCR_OFFSET      0x03dc  /* DMA control register (32-bit) */
#define STM32_ATIM_DMAR_OFFSET     0x03e0  /* DMA address for full transfer (32-bit) */

