apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_tim_v3.h
/* Register Addresses *******************************************************/

/* ATIM: Advanced Timers - TIM1, TIM8, and TIM20 */

#if STM32_NATIM > 0
#  define STM32_TIM1_CR1               (STM32_TIM1_BASE + STM32_ATIM_CR1_OFFSET)
#  define STM32_TIM1_CR2               (STM32_TIM1_BASE + STM32_ATIM_CR2_OFFSET)
#  define STM32_TIM1_SMCR              (STM32_TIM1_BASE + STM32_ATIM_SMCR_OFFSET)
#  define STM32_TIM1_DIER              (STM32_TIM1_BASE + STM32_ATIM_DIER_OFFSET)
#  define STM32_TIM1_SR                (STM32_TIM1_BASE + STM32_ATIM_SR_OFFSET)
#  define STM32_TIM1_EGR               (STM32_TIM1_BASE + STM32_ATIM_EGR_OFFSET)
#  define STM32_TIM1_CCMR1             (STM32_TIM1_BASE + STM32_ATIM_CCMR1_OFFSET)
#  define STM32_TIM1_CCMR2             (STM32_TIM1_BASE + STM32_ATIM_CCMR2_OFFSET)
#  define STM32_TIM1_CCER              (STM32_TIM1_BASE + STM32_ATIM_CCER_OFFSET)
#  define STM32_TIM1_CNT               (STM32_TIM1_BASE + STM32_ATIM_CNT_OFFSET)
#  define STM32_TIM1_PSC               (STM32_TIM1_BASE + STM32_ATIM_PSC_OFFSET)
#  define STM32_TIM1_ARR               (STM32_TIM1_BASE + STM32_ATIM_ARR_OFFSET)
#  define STM32_TIM1_RCR               (STM32_TIM1_BASE + STM32_ATIM_RCR_OFFSET)
#  define STM32_TIM1_CCR1              (STM32_TIM1_BASE + STM32_ATIM_CCR1_OFFSET)
#  define STM32_TIM1_CCR2              (STM32_TIM1_BASE + STM32_ATIM_CCR2_OFFSET)
#  define STM32_TIM1_CCR3              (STM32_TIM1_BASE + STM32_ATIM_CCR3_OFFSET)
#  define STM32_TIM1_CCR4              (STM32_TIM1_BASE + STM32_ATIM_CCR4_OFFSET)
#  define STM32_TIM1_BDTR              (STM32_TIM1_BASE + STM32_ATIM_BDTR_OFFSET)
#  define STM32_TIM1_CCR5              (STM32_TIM1_BASE + STM32_ATIM_CCR5_OFFSET)
#  define STM32_TIM1_CCR6              (STM32_TIM1_BASE + STM32_ATIM_CCR6_OFFSET)
#  define STM32_TIM1_CCMR3             (STM32_TIM1_BASE + STM32_ATIM_CCMR3_OFFSET)
#  define STM32_TIM1_DTR2              (STM32_TIM1_BASE + STM32_ATIM_DTR2_OFFSET)
#  define STM32_TIM1_ECR               (STM32_TIM1_BASE + STM32_ATIM_ECR_OFFSET)
#  define STM32_TIM1_TISEL             (STM32_TIM1_BASE + STM32_ATIM_TISEL_OFFSET)
#  define STM32_TIM1_AF1               (STM32_TIM1_BASE + STM32_ATIM_AF1_OFFSET)
#  define STM32_TIM1_AF2               (STM32_TIM1_BASE + STM32_ATIM_AF2_OFFSET)
#  define STM32_TIM1_DCR               (STM32_TIM1_BASE + STM32_ATIM_DCR_OFFSET)
#  define STM32_TIM1_DMAR              (STM32_TIM1_BASE + STM32_ATIM_DMAR_OFFSET)
#endif

#if STM32_NATIM > 1
#  define STM32_TIM8_CR1               (STM32_TIM8_BASE + STM32_ATIM_CR1_OFFSET)
#  define STM32_TIM8_CR2               (STM32_TIM8_BASE + STM32_ATIM_CR2_OFFSET)
#  define STM32_TIM8_SMCR              (STM32_TIM8_BASE + STM32_ATIM_SMCR_OFFSET)
#  define STM32_TIM8_DIER              (STM32_TIM8_BASE + STM32_ATIM_DIER_OFFSET)
#  define STM32_TIM8_SR                (STM32_TIM8_BASE + STM32_ATIM_SR_OFFSET)
#  define STM32_TIM8_EGR               (STM32_TIM8_BASE + STM32_ATIM_EGR_OFFSET)
#  define STM32_TIM8_CCMR1             (STM32_TIM8_BASE + STM32_ATIM_CCMR1_OFFSET)
#  define STM32_TIM8_CCMR2             (STM32_TIM8_BASE + STM32_ATIM_CCMR2_OFFSET)
#  define STM32_TIM8_CCER              (STM32_TIM8_BASE + STM32_ATIM_CCER_OFFSET)
#  define STM32_TIM8_CNT               (STM32_TIM8_BASE + STM32_ATIM_CNT_OFFSET)
#  define STM32_TIM8_PSC               (STM32_TIM8_BASE + STM32_ATIM_PSC_OFFSET)
#  define STM32_TIM8_ARR               (STM32_TIM8_BASE + STM32_ATIM_ARR_OFFSET)
#  define STM32_TIM8_RCR               (STM32_TIM8_BASE + STM32_ATIM_RCR_OFFSET)
#  define STM32_TIM8_CCR1              (STM32_TIM8_BASE + STM32_ATIM_CCR1_OFFSET)
#  define STM32_TIM8_CCR2              (STM32_TIM8_BASE + STM32_ATIM_CCR2_OFFSET)
#  define STM32_TIM8_CCR3              (STM32_TIM8_BASE + STM32_ATIM_CCR3_OFFSET)
#  define STM32_TIM8_CCR4              (STM32_TIM8_BASE + STM32_ATIM_CCR4_OFFSET)
#  define STM32_TIM8_BDTR              (STM32_TIM8_BASE + STM32_ATIM_BDTR_OFFSET)
#  define STM32_TIM8_CCR5              (STM32_TIM8_BASE + STM32_ATIM_CCR5_OFFSET)
#  define STM32_TIM8_CCR6              (STM32_TIM8_BASE + STM32_ATIM_CCR6_OFFSET)
#  define STM32_TIM8_CCMR3             (STM32_TIM8_BASE + STM32_ATIM_CCMR3_OFFSET)
#  define STM32_TIM8_DTR2              (STM32_TIM8_BASE + STM32_ATIM_DTR2_OFFSET)
#  define STM32_TIM8_ECR               (STM32_TIM8_BASE + STM32_ATIM_ECR_OFFSET)
#  define STM32_TIM8_TISEL             (STM32_TIM8_BASE + STM32_ATIM_TISEL_OFFSET)
#  define STM32_TIM8_AF1               (STM32_TIM8_BASE + STM32_ATIM_AF1_OFFSET)
#  define STM32_TIM8_AF2               (STM32_TIM8_BASE + STM32_ATIM_AF2_OFFSET)
#  define STM32_TIM8_DCR               (STM32_TIM8_BASE + STM32_ATIM_DCR_OFFSET)
#  define STM32_TIM8_DMAR              (STM32_TIM8_BASE + STM32_ATIM_DMAR_OFFSET)
#endif

#if STM32_NATIM > 2
#  define STM32_TIM20_CR1              (STM32_TIM20_BASE + STM32_ATIM_CR1_OFFSET)
#  define STM32_TIM20_CR2              (STM32_TIM20_BASE + STM32_ATIM_CR2_OFFSET)
#  define STM32_TIM20_SMCR             (STM32_TIM20_BASE + STM32_ATIM_SMCR_OFFSET)
#  define STM32_TIM20_DIER             (STM32_TIM20_BASE + STM32_ATIM_DIER_OFFSET)
#  define STM32_TIM20_SR               (STM32_TIM20_BASE + STM32_ATIM_SR_OFFSET)
#  define STM32_TIM20_EGR              (STM32_TIM20_BASE + STM32_ATIM_EGR_OFFSET)
#  define STM32_TIM20_CCMR1            (STM32_TIM20_BASE + STM32_ATIM_CCMR1_OFFSET)
#  define STM32_TIM20_CCMR2            (STM32_TIM20_BASE + STM32_ATIM_CCMR2_OFFSET)
#  define STM32_TIM20_CCER             (STM32_TIM20_BASE + STM32_ATIM_CCER_OFFSET)
#  define STM32_TIM20_CNT              (STM32_TIM20_BASE + STM32_ATIM_CNT_OFFSET)
#  define STM32_TIM20_PSC              (STM32_TIM20_BASE + STM32_ATIM_PSC_OFFSET)
#  define STM32_TIM20_ARR              (STM32_TIM20_BASE + STM32_ATIM_ARR_OFFSET)
#  define STM32_TIM20_RCR              (STM32_TIM20_BASE + STM32_ATIM_RCR_OFFSET)
#  define STM32_TIM20_CCR1             (STM32_TIM20_BASE + STM32_ATIM_CCR1_OFFSET)
#  define STM32_TIM20_CCR2             (STM32_TIM20_BASE + STM32_ATIM_CCR2_OFFSET)
#  define STM32_TIM20_CCR3             (STM32_TIM20_BASE + STM32_ATIM_CCR3_OFFSET)
#  define STM32_TIM20_CCR4             (STM32_TIM20_BASE + STM32_ATIM_CCR4_OFFSET)
#  define STM32_TIM20_BDTR             (STM32_TIM20_BASE + STM32_ATIM_BDTR_OFFSET)
#  define STM32_TIM20_CCR5             (STM32_TIM20_BASE + STM32_ATIM_CCR5_OFFSET)
#  define STM32_TIM20_CCR6             (STM32_TIM20_BASE + STM32_ATIM_CCR6_OFFSET)
#  define STM32_TIM20_CCMR3            (STM32_TIM20_BASE + STM32_ATIM_CCMR3_OFFSET)
#  define STM32_TIM20_DTR2             (STM32_TIM20_BASE + STM32_ATIM_DTR2_OFFSET)
#  define STM32_TIM20_ECR              (STM32_TIM20_BASE + STM32_ATIM_ECR_OFFSET)
#  define STM32_TIM20_TISEL            (STM32_TIM20_BASE + STM32_ATIM_TISEL_OFFSET)
#  define STM32_TIM20_AF1              (STM32_TIM20_BASE + STM32_ATIM_AF1_OFFSET)
#  define STM32_TIM20_AF2              (STM32_TIM20_BASE + STM32_ATIM_AF2_OFFSET)
#  define STM32_TIM20_DCR              (STM32_TIM20_BASE + STM32_ATIM_DCR_OFFSET)
#  define STM32_TIM20_DMAR             (STM32_TIM20_BASE + STM32_ATIM_DMAR_OFFSET)
#endif

