apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_tim_v3.h
/* GTIM: General Timers
 * 16-/32-bit General Timers with DMA: TIM2, TM3, TIM4, and TIM5
 * 16-bit General Timers with DMA: TIM15, TIM16, and TIM17
 */

#if STM32_NGTIM > 0
#  define STM32_TIM2_CR1               (STM32_TIM2_BASE + STM32_GTIM_CR1_OFFSET)
#  define STM32_TIM2_CR2               (STM32_TIM2_BASE + STM32_GTIM_CR2_OFFSET)
#  define STM32_TIM2_SMCR              (STM32_TIM2_BASE + STM32_GTIM_SMCR_OFFSET)
#  define STM32_TIM2_DIER              (STM32_TIM2_BASE + STM32_GTIM_DIER_OFFSET)
#  define STM32_TIM2_SR                (STM32_TIM2_BASE + STM32_GTIM_SR_OFFSET)
#  define STM32_TIM2_EGR               (STM32_TIM2_BASE + STM32_GTIM_EGR_OFFSET)
#  define STM32_TIM2_CCMR1             (STM32_TIM2_BASE + STM32_GTIM_CCMR1_OFFSET)
#  define STM32_TIM2_CCMR2             (STM32_TIM2_BASE + STM32_GTIM_CCMR2_OFFSET)
#  define STM32_TIM2_CCER              (STM32_TIM2_BASE + STM32_GTIM_CCER_OFFSET)
#  define STM32_TIM2_CNT               (STM32_TIM2_BASE + STM32_GTIM_CNT_OFFSET)
#  define STM32_TIM2_PSC               (STM32_TIM2_BASE + STM32_GTIM_PSC_OFFSET)
#  define STM32_TIM2_ARR               (STM32_TIM2_BASE + STM32_GTIM_ARR_OFFSET)
#  define STM32_TIM2_CCR1              (STM32_TIM2_BASE + STM32_GTIM_CCR1_OFFSET)
#  define STM32_TIM2_CCR2              (STM32_TIM2_BASE + STM32_GTIM_CCR2_OFFSET)
#  define STM32_TIM2_CCR3              (STM32_TIM2_BASE + STM32_GTIM_CCR3_OFFSET)
#  define STM32_TIM2_CCR4              (STM32_TIM2_BASE + STM32_GTIM_CCR4_OFFSET)
#  define STM32_TIM2_ECR               (STM32_TIM2_BASE + STM32_GTIM_ECR_OFFSET)
#  define STM32_TIM2_TISEL             (STM32_TIM2_BASE + STM32_GTIM_TISEL_OFFSET)
#  define STM32_TIM2_AF1               (STM32_TIM2_BASE + STM32_GTIM_AF1_OFFSET)
#  define STM32_TIM2_AF2               (STM32_TIM2_BASE + STM32_GTIM_AF2_OFFSET)
#  define STM32_TIM2_DCR               (STM32_TIM2_BASE + STM32_GTIM_DCR_OFFSET)
#  define STM32_TIM2_DMAR              (STM32_TIM2_BASE + STM32_GTIM_DMAR_OFFSET)
#endif

#if STM32_NGTIM > 1
#  define STM32_TIM3_CR1               (STM32_TIM3_BASE + STM32_GTIM_CR1_OFFSET)
#  define STM32_TIM3_CR2               (STM32_TIM3_BASE + STM32_GTIM_CR2_OFFSET)
#  define STM32_TIM3_SMCR              (STM32_TIM3_BASE + STM32_GTIM_SMCR_OFFSET)
#  define STM32_TIM3_DIER              (STM32_TIM3_BASE + STM32_GTIM_DIER_OFFSET)
#  define STM32_TIM3_SR                (STM32_TIM3_BASE + STM32_GTIM_SR_OFFSET)
#  define STM32_TIM3_EGR               (STM32_TIM3_BASE + STM32_GTIM_EGR_OFFSET)
#  define STM32_TIM3_CCMR1             (STM32_TIM3_BASE + STM32_GTIM_CCMR1_OFFSET)
#  define STM32_TIM3_CCMR2             (STM32_TIM3_BASE + STM32_GTIM_CCMR2_OFFSET)
#  define STM32_TIM3_CCER              (STM32_TIM3_BASE + STM32_GTIM_CCER_OFFSET)
#  define STM32_TIM3_CNT               (STM32_TIM3_BASE + STM32_GTIM_CNT_OFFSET)
#  define STM32_TIM3_PSC               (STM32_TIM3_BASE + STM32_GTIM_PSC_OFFSET)
#  define STM32_TIM3_ARR               (STM32_TIM3_BASE + STM32_GTIM_ARR_OFFSET)
#  define STM32_TIM3_CCR1              (STM32_TIM3_BASE + STM32_GTIM_CCR1_OFFSET)
#  define STM32_TIM3_CCR2              (STM32_TIM3_BASE + STM32_GTIM_CCR2_OFFSET)
#  define STM32_TIM3_CCR3              (STM32_TIM3_BASE + STM32_GTIM_CCR3_OFFSET)
#  define STM32_TIM3_CCR4              (STM32_TIM3_BASE + STM32_GTIM_CCR4_OFFSET)
#  define STM32_TIM3_ECR               (STM32_TIM3_BASE + STM32_GTIM_ECR_OFFSET)
#  define STM32_TIM3_TISEL             (STM32_TIM3_BASE + STM32_GTIM_TISEL_OFFSET)
#  define STM32_TIM3_AF1               (STM32_TIM3_BASE + STM32_GTIM_AF1_OFFSET)
#  define STM32_TIM3_AF2               (STM32_TIM3_BASE + STM32_GTIM_AF2_OFFSET)
#  define STM32_TIM3_DCR               (STM32_TIM3_BASE + STM32_GTIM_DCR_OFFSET)
#  define STM32_TIM3_DMAR              (STM32_TIM3_BASE + STM32_GTIM_DMAR_OFFSET)
#endif

#if STM32_NGTIM > 2
#  define STM32_TIM4_CR1               (STM32_TIM4_BASE + STM32_GTIM_CR1_OFFSET)
#  define STM32_TIM4_CR2               (STM32_TIM4_BASE + STM32_GTIM_CR2_OFFSET)
#  define STM32_TIM4_SMCR              (STM32_TIM4_BASE + STM32_GTIM_SMCR_OFFSET)
#  define STM32_TIM4_DIER              (STM32_TIM4_BASE + STM32_GTIM_DIER_OFFSET)
#  define STM32_TIM4_SR                (STM32_TIM4_BASE + STM32_GTIM_SR_OFFSET)
#  define STM32_TIM4_EGR               (STM32_TIM4_BASE + STM32_GTIM_EGR_OFFSET)
#  define STM32_TIM4_CCMR1             (STM32_TIM4_BASE + STM32_GTIM_CCMR1_OFFSET)
#  define STM32_TIM4_CCMR2             (STM32_TIM4_BASE + STM32_GTIM_CCMR2_OFFSET)
#  define STM32_TIM4_CCER              (STM32_TIM4_BASE + STM32_GTIM_CCER_OFFSET)
#  define STM32_TIM4_CNT               (STM32_TIM4_BASE + STM32_GTIM_CNT_OFFSET)
#  define STM32_TIM4_PSC               (STM32_TIM4_BASE + STM32_GTIM_PSC_OFFSET)
#  define STM32_TIM4_ARR               (STM32_TIM4_BASE + STM32_GTIM_ARR_OFFSET)
#  define STM32_TIM4_CCR1              (STM32_TIM4_BASE + STM32_GTIM_CCR1_OFFSET)
#  define STM32_TIM4_CCR2              (STM32_TIM4_BASE + STM32_GTIM_CCR2_OFFSET)
#  define STM32_TIM4_CCR3              (STM32_TIM4_BASE + STM32_GTIM_CCR3_OFFSET)
#  define STM32_TIM4_CCR4              (STM32_TIM4_BASE + STM32_GTIM_CCR4_OFFSET)
#  define STM32_TIM4_ECR               (STM32_TIM4_BASE + STM32_GTIM_ECR_OFFSET)
#  define STM32_TIM4_TISEL             (STM32_TIM4_BASE + STM32_GTIM_TISEL_OFFSET)
#  define STM32_TIM4_AF1               (STM32_TIM4_BASE + STM32_GTIM_AF1_OFFSET)
#  define STM32_TIM4_AF2               (STM32_TIM4_BASE + STM32_GTIM_AF2_OFFSET)
#  define STM32_TIM4_DCR               (STM32_TIM4_BASE + STM32_GTIM_DCR_OFFSET)
#  define STM32_TIM4_DMAR              (STM32_TIM4_BASE + STM32_GTIM_DMAR_OFFSET)
#endif

#if STM32_NGTIM > 3
#  define STM32_TIM5_CR1               (STM32_TIM5_BASE + STM32_GTIM_CR1_OFFSET)
#  define STM32_TIM5_CR2               (STM32_TIM5_BASE + STM32_GTIM_CR2_OFFSET)
#  define STM32_TIM5_SMCR              (STM32_TIM5_BASE + STM32_GTIM_SMCR_OFFSET)
#  define STM32_TIM5_DIER              (STM32_TIM5_BASE + STM32_GTIM_DIER_OFFSET)
#  define STM32_TIM5_SR                (STM32_TIM5_BASE + STM32_GTIM_SR_OFFSET)
#  define STM32_TIM5_EGR               (STM32_TIM5_BASE + STM32_GTIM_EGR_OFFSET)
#  define STM32_TIM5_CCMR1             (STM32_TIM5_BASE + STM32_GTIM_CCMR1_OFFSET)
#  define STM32_TIM5_CCMR2             (STM32_TIM5_BASE + STM32_GTIM_CCMR2_OFFSET)
#  define STM32_TIM5_CCER              (STM32_TIM5_BASE + STM32_GTIM_CCER_OFFSET)
#  define STM32_TIM5_CNT               (STM32_TIM5_BASE + STM32_GTIM_CNT_OFFSET)
#  define STM32_TIM5_PSC               (STM32_TIM5_BASE + STM32_GTIM_PSC_OFFSET)
#  define STM32_TIM5_ARR               (STM32_TIM5_BASE + STM32_GTIM_ARR_OFFSET)
#  define STM32_TIM5_CCR1              (STM32_TIM5_BASE + STM32_GTIM_CCR1_OFFSET)
#  define STM32_TIM5_CCR2              (STM32_TIM5_BASE + STM32_GTIM_CCR2_OFFSET)
#  define STM32_TIM5_CCR3              (STM32_TIM5_BASE + STM32_GTIM_CCR3_OFFSET)
#  define STM32_TIM5_CCR4              (STM32_TIM5_BASE + STM32_GTIM_CCR4_OFFSET)
#  define STM32_TIM5_ECR               (STM32_TIM5_BASE + STM32_GTIM_ECR_OFFSET)
#  define STM32_TIM5_TISEL             (STM32_TIM5_BASE + STM32_GTIM_TISEL_OFFSET)
#  define STM32_TIM5_AF1               (STM32_TIM5_BASE + STM32_GTIM_AF1_OFFSET)
#  define STM32_TIM5_AF2               (STM32_TIM5_BASE + STM32_GTIM_AF2_OFFSET)
#  define STM32_TIM5_DCR               (STM32_TIM5_BASE + STM32_GTIM_DCR_OFFSET)
#  define STM32_TIM5_DMAR              (STM32_TIM5_BASE + STM32_GTIM_DMAR_OFFSET)
#endif

#if STM32_NGTIM > 4
#  define STM32_TIM15_CR1              (STM32_TIM15_BASE + STM32_GTIM_CR1_OFFSET)
#  define STM32_TIM15_CR2              (STM32_TIM15_BASE + STM32_GTIM_CR2_OFFSET)
#  define STM32_TIM15_SMCR             (STM32_TIM15_BASE + STM32_GTIM_SMCR_OFFSET)
#  define STM32_TIM15_DIER             (STM32_TIM15_BASE + STM32_GTIM_DIER_OFFSET)
#  define STM32_TIM15_SR               (STM32_TIM15_BASE + STM32_GTIM_SR_OFFSET)
#  define STM32_TIM15_EGR              (STM32_TIM15_BASE + STM32_GTIM_EGR_OFFSET)
#  define STM32_TIM15_CCMR1            (STM32_TIM15_BASE + STM32_GTIM_CCMR1_OFFSET)
#  define STM32_TIM15_CCMR2            (STM32_TIM15_BASE + STM32_GTIM_CCMR2_OFFSET)
#  define STM32_TIM15_CCER             (STM32_TIM15_BASE + STM32_GTIM_CCER_OFFSET)
#  define STM32_TIM15_CNT              (STM32_TIM15_BASE + STM32_GTIM_CNT_OFFSET)
#  define STM32_TIM15_PSC              (STM32_TIM15_BASE + STM32_GTIM_PSC_OFFSET)
#  define STM32_TIM15_ARR              (STM32_TIM15_BASE + STM32_GTIM_ARR_OFFSET)
#  define STM32_TIM15_CCR1             (STM32_TIM15_BASE + STM32_GTIM_CCR1_OFFSET)
#  define STM32_TIM15_CCR2             (STM32_TIM15_BASE + STM32_GTIM_CCR2_OFFSET)
#  define STM32_TIM15_CCR3             (STM32_TIM15_BASE + STM32_GTIM_CCR3_OFFSET)
#  define STM32_TIM15_CCR4             (STM32_TIM15_BASE + STM32_GTIM_CCR4_OFFSET)
#  define STM32_TIM15_ECR              (STM32_TIM15_BASE + STM32_GTIM_ECR_OFFSET)
#  define STM32_TIM15_TISEL            (STM32_TIM15_BASE + STM32_GTIM_TISEL_OFFSET)
#  define STM32_TIM15_AF1              (STM32_TIM15_BASE + STM32_GTIM_AF1_OFFSET)
#  define STM32_TIM15_AF2              (STM32_TIM15_BASE + STM32_GTIM_AF2_OFFSET)
#  define STM32_TIM15_DCR              (STM32_TIM15_BASE + STM32_GTIM_DCR_OFFSET)
#  define STM32_TIM15_DMAR             (STM32_TIM15_BASE + STM32_GTIM_DMAR_OFFSET)
#endif

