apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_tim_v3.h
#if STM32_NGTIM > 5
#  define STM32_TIM16_CR1              (STM32_TIM16_BASE + STM32_GTIM_CR1_OFFSET)
#  define STM32_TIM16_CR2              (STM32_TIM16_BASE + STM32_GTIM_CR2_OFFSET)
#  define STM32_TIM16_SMCR             (STM32_TIM16_BASE + STM32_GTIM_SMCR_OFFSET)
#  define STM32_TIM16_DIER             (STM32_TIM16_BASE + STM32_GTIM_DIER_OFFSET)
#  define STM32_TIM16_SR               (STM32_TIM16_BASE + STM32_GTIM_SR_OFFSET)
#  define STM32_TIM16_EGR              (STM32_TIM16_BASE + STM32_GTIM_EGR_OFFSET)
#  define STM32_TIM16_CCMR1            (STM32_TIM16_BASE + STM32_GTIM_CCMR1_OFFSET)
#  define STM32_TIM16_CCMR2            (STM32_TIM16_BASE + STM32_GTIM_CCMR2_OFFSET)
#  define STM32_TIM16_CCER             (STM32_TIM16_BASE + STM32_GTIM_CCER_OFFSET)
#  define STM32_TIM16_CNT              (STM32_TIM16_BASE + STM32_GTIM_CNT_OFFSET)
#  define STM32_TIM16_PSC              (STM32_TIM16_BASE + STM32_GTIM_PSC_OFFSET)
#  define STM32_TIM16_ARR              (STM32_TIM16_BASE + STM32_GTIM_ARR_OFFSET)
#  define STM32_TIM16_CCR1             (STM32_TIM16_BASE + STM32_GTIM_CCR1_OFFSET)
#  define STM32_TIM16_CCR2             (STM32_TIM16_BASE + STM32_GTIM_CCR2_OFFSET)
#  define STM32_TIM16_CCR3             (STM32_TIM16_BASE + STM32_GTIM_CCR3_OFFSET)
#  define STM32_TIM16_CCR4             (STM32_TIM16_BASE + STM32_GTIM_CCR4_OFFSET)
#  define STM32_TIM16_ECR              (STM32_TIM16_BASE + STM32_GTIM_ECR_OFFSET)
#  define STM32_TIM16_TISEL            (STM32_TIM16_BASE + STM32_GTIM_TISEL_OFFSET)
#  define STM32_TIM16_AF1              (STM32_TIM16_BASE + STM32_GTIM_AF1_OFFSET)
#  define STM32_TIM16_AF2              (STM32_TIM16_BASE + STM32_GTIM_AF2_OFFSET)
#  define STM32_TIM16_DCR              (STM32_TIM16_BASE + STM32_GTIM_DCR_OFFSET)
#  define STM32_TIM16_DMAR             (STM32_TIM16_BASE + STM32_GTIM_DMAR_OFFSET)
#endif

#if STM32_NGTIM > 6
#  define STM32_TIM17_CR1              (STM32_TIM17_BASE + STM32_GTIM_CR1_OFFSET)
#  define STM32_TIM17_CR2              (STM32_TIM17_BASE + STM32_GTIM_CR2_OFFSET)
#  define STM32_TIM17_SMCR             (STM32_TIM17_BASE + STM32_GTIM_SMCR_OFFSET)
#  define STM32_TIM17_DIER             (STM32_TIM17_BASE + STM32_GTIM_DIER_OFFSET)
#  define STM32_TIM17_SR               (STM32_TIM17_BASE + STM32_GTIM_SR_OFFSET)
#  define STM32_TIM17_EGR              (STM32_TIM17_BASE + STM32_GTIM_EGR_OFFSET)
#  define STM32_TIM17_CCMR1            (STM32_TIM17_BASE + STM32_GTIM_CCMR1_OFFSET)
#  define STM32_TIM17_CCMR2            (STM32_TIM17_BASE + STM32_GTIM_CCMR2_OFFSET)
#  define STM32_TIM17_CCER             (STM32_TIM17_BASE + STM32_GTIM_CCER_OFFSET)
#  define STM32_TIM17_CNT              (STM32_TIM17_BASE + STM32_GTIM_CNT_OFFSET)
#  define STM32_TIM17_PSC              (STM32_TIM17_BASE + STM32_GTIM_PSC_OFFSET)
#  define STM32_TIM17_ARR              (STM32_TIM17_BASE + STM32_GTIM_ARR_OFFSET)
#  define STM32_TIM17_CCR1             (STM32_TIM17_BASE + STM32_GTIM_CCR1_OFFSET)
#  define STM32_TIM17_CCR2             (STM32_TIM17_BASE + STM32_GTIM_CCR2_OFFSET)
#  define STM32_TIM17_CCR3             (STM32_TIM17_BASE + STM32_GTIM_CCR3_OFFSET)
#  define STM32_TIM17_CCR4             (STM32_TIM17_BASE + STM32_GTIM_CCR4_OFFSET)
#  define STM32_TIM17_ECR              (STM32_TIM17_BASE + STM32_GTIM_ECR_OFFSET)
#  define STM32_TIM17_TISEL            (STM32_TIM17_BASE + STM32_GTIM_TISEL_OFFSET)
#  define STM32_TIM17_AF1              (STM32_TIM17_BASE + STM32_GTIM_AF1_OFFSET)
#  define STM32_TIM17_AF2              (STM32_TIM17_BASE + STM32_GTIM_AF2_OFFSET)
#  define STM32_TIM17_DCR              (STM32_TIM17_BASE + STM32_GTIM_DCR_OFFSET)
#  define STM32_TIM17_DMAR             (STM32_TIM17_BASE + STM32_GTIM_DMAR_OFFSET)
#endif

/* BTIM: Basic Timers - TIM6 and TIM7 */

#if STM32_NBTIM > 0
#  define STM32_TIM6_CR1               (STM32_TIM6_BASE + STM32_BTIM_CR1_OFFSET)
#  define STM32_TIM6_CR2               (STM32_TIM6_BASE + STM32_BTIM_CR2_OFFSET)
#  define STM32_TIM6_DIER              (STM32_TIM6_BASE + STM32_BTIM_DIER_OFFSET)
#  define STM32_TIM6_SR                (STM32_TIM6_BASE + STM32_BTIM_SR_OFFSET)
#  define STM32_TIM6_EGR               (STM32_TIM6_BASE + STM32_BTIM_EGR_OFFSET)
#  define STM32_TIM6_CNT               (STM32_TIM6_BASE + STM32_BTIM_CNT_OFFSET)
#  define STM32_TIM6_PSC               (STM32_TIM6_BASE + STM32_BTIM_PSC_OFFSET)
#  define STM32_TIM6_ARR               (STM32_TIM6_BASE + STM32_BTIM_ARR_OFFSET)
#endif

#if STM32_NBTIM > 1
#  define STM32_TIM7_CR1               (STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET)
#  define STM32_TIM7_CR2               (STM32_TIM7_BASE + STM32_BTIM_CR2_OFFSET)
#  define STM32_TIM7_DIER              (STM32_TIM7_BASE + STM32_BTIM_DIER_OFFSET)
#  define STM32_TIM7_SR                (STM32_TIM7_BASE + STM32_BTIM_SR_OFFSET)
#  define STM32_TIM7_EGR               (STM32_TIM7_BASE + STM32_BTIM_EGR_OFFSET)
#  define STM32_TIM7_CNT               (STM32_TIM7_BASE + STM32_BTIM_CNT_OFFSET)
#  define STM32_TIM7_PSC               (STM32_TIM7_BASE + STM32_BTIM_PSC_OFFSET)
#  define STM32_TIM7_ARR               (STM32_TIM7_BASE + STM32_BTIM_ARR_OFFSET)
#endif

/* Register Bitfield Definitions - ATIM *************************************/

/* ATIM: Advanced Timers - TIM1, TIM8, and TIM20 */

/* ATIM Control register 1 (CR1) */

#define ATIM_CR1_CEN                   (1 << 0)                           /* Bit 0: Counter enable */
#define ATIM_CR1_UDIS                  (1 << 1)                           /* Bit 1: Update disable */
#define ATIM_CR1_URS                   (1 << 2)                           /* Bit 2: Update request source */
#define ATIM_CR1_OPM                   (1 << 3)                           /* Bit 3: One pulse mode */
#define ATIM_CR1_DIR                   (1 << 4)                           /* Bit 4: Direction */
#define ATIM_CR1_CMS_SHIFT             (5)                                /* Bits 5-6: Center-aligned mode selection */
#define ATIM_CR1_CMS_MASK              (0x3 << ATIM_CR1_CMS_SHIFT)
#  define ATIM_CR1_EDGE                (0x0 << ATIM_CR1_CMS_SHIFT)        /* 00: Edge-aligned mode */
#  define ATIM_CR1_CENTER1             (0x1 << ATIM_CR1_CMS_SHIFT)        /* 01: Center-aligned mode 1 */
#  define ATIM_CR1_CENTER2             (0x2 << ATIM_CR1_CMS_SHIFT)        /* 10: Center-aligned mode 2 */
#  define ATIM_CR1_CENTER3             (0x3 << ATIM_CR1_CMS_SHIFT)        /* 11: Center-aligned mode 3 */
#define ATIM_CR1_ARPE                  (1 << 7)                           /* Bit 7: Auto-reload preload enable */
#define ATIM_CR1_CKD_SHIFT             (8)                                /* Bits 8-9: Clock division */
#define ATIM_CR1_CKD_MASK              (0x3 << ATIM_CR1_CKD_SHIFT)
#  define ATIM_CR1_TCKINT              (0x0 << ATIM_CR1_CKD_SHIFT)        /* 00: tDTS=1*tCK_INT */
#  define ATIM_CR1_2TCKINT             (0x1 << ATIM_CR1_CKD_SHIFT)        /* 01: tDTS=2*tCK_INT */
#  define ATIM_CR1_4TCKINT             (0x2 << ATIM_CR1_CKD_SHIFT)        /* 10: tDTS=4*tCK_INT */
#define ATIM_CR1_UIFREMAP              (1 << 11)                          /* Bit 11: UIF status bit remapping */
#define ATIM_CR1_DITHEN                (1 << 12)                          /* Bit 12: Dithering enable */

