apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_tim_v3.h
/* ATIM DMA/Interrupt enable register (DIER) */

#define ATIM_DIER_UIE                  (1 << 0)                           /* Bit 0: Update interrupt enable */
#define ATIM_DIER_CC1IE                (1 << 1)                           /* Bit 1: Capture/Compare 1 interrupt enable */
#define ATIM_DIER_CC2IE                (1 << 2)                           /* Bit 2: Capture/Compare 2 interrupt enable */
#define ATIM_DIER_CC3IE                (1 << 3)                           /* Bit 3: Capture/Compare 3 interrupt enable */
#define ATIM_DIER_CC4IE                (1 << 4)                           /* Bit 4: Capture/Compare 4 interrupt enable */
#define ATIM_DIER_COMIE                (1 << 5)                           /* Bit 5: COM interrupt enable */
#define ATIM_DIER_TIE                  (1 << 6)                           /* Bit 6: Trigger interrupt enable */
#define ATIM_DIER_BIE                  (1 << 7)                           /* Bit 7: Break interrupt enable */
#define ATIM_DIER_UDE                  (1 << 8)                           /* Bit 8: Update DMA request enable */
#define ATIM_DIER_CC1DE                (1 << 9)                           /* Bit 9: Capture/Compare 1 DMA request enable */
#define ATIM_DIER_CC2DE                (1 << 10)                          /* Bit 10: Capture/Compare 2 DMA request enable */
#define ATIM_DIER_CC3DE                (1 << 11)                          /* Bit 11: Capture/Compare 3 DMA request enable */
#define ATIM_DIER_CC4DE                (1 << 12)                          /* Bit 12: Capture/Compare 4 DMA request enable */
#define ATIM_DIER_COMDE                (1 << 13)                          /* Bit 13: COM DMA request enable */
#define ATIM_DIER_TDE                  (1 << 14)                          /* Bit 14: Trigger DMA request enable */
#define ATIM_DIER_IDXIE                (1 << 20)                          /* Bit 20: Index interrupt enable */
#define ATIM_DIER_DIRIE                (1 << 21)                          /* Bit 21: Direction change interrupt enable */
#define ATIM_DIER_IERRIE               (1 << 22)                          /* Bit 22: Index error interrupt enable */
#define ATIM_DIER_TERRIE               (1 << 23)                          /* Bit 23: Transition error interrupt enable */

/* ATIM Status register (SR) */

#define ATIM_SR_UIF                    (1 << 0)                           /* Bit 0: Update Interrupt Flag */
#define ATIM_SR_CC1IF                  (1 << 1)                           /* Bit 1: Capture/Compare 1 Interrupt Flag */
#define ATIM_SR_CC2IF                  (1 << 2)                           /* Bit 2: Capture/Compare 2 Interrupt Flag */
#define ATIM_SR_CC3IF                  (1 << 3)                           /* Bit 3: Capture/Compare 3 Interrupt Flag */
#define ATIM_SR_CC4IF                  (1 << 4)                           /* Bit 4: Capture/Compare 4 Interrupt Flag */
#define ATIM_SR_COMIF                  (1 << 5)                           /* Bit 5: Com Interrupt Flag */
#define ATIM_SR_TIF                    (1 << 6)                           /* Bit 6: Trigger Interrupt Flag */
#define ATIM_SR_BIF                    (1 << 7)                           /* Bit 7: Break Interrupt Flag */
#define ATIM_SR_B2IF                   (1 << 8)                           /* Bit 8: Break 2 Interrupt Flag */
#define ATIM_SR_CC1OF                  (1 << 9)                           /* Bit 9: Capture/Compare 1 Overcapture Flag */
#define ATIM_SR_CC2OF                  (1 << 10)                          /* Bit 10: Capture/Compare 2 Overcapture Flag */
#define ATIM_SR_CC3OF                  (1 << 11)                          /* Bit 11: Capture/Compare 3 Overcapture Flag */
#define ATIM_SR_CC4OF                  (1 << 12)                          /* Bit 12: Capture/Compare 4 Overcapture Flag */
#define ATIM_SR_SBIF                   (1 << 13)                          /* Bit 13: System Break Interrupt Flag */
#define ATIM_SR_CC5IF                  (1 << 16)                          /* Bit 16: Compare 5 Interrupt Flag */
#define ATIM_SR_CC6IF                  (1 << 17)                          /* Bit 17: Compare 6 Interrupt Flag */
#define ATIM_SR_IDXF                   (1 << 20)                          /* Bit 20: Index Interrupt Flag */
#define ATIM_SR_DIRF                   (1 << 21)                          /* Bit 21: Direction Change Interrupt Flag */
#define ATIM_SR_IERRF                  (1 << 22)                          /* Bit 22: Index Error Interrupt Flag */
#define ATIM_SR_TERRF                  (1 << 23)                          /* Bit 23: Transition Error Interrupt Flag */

/* ATIM Event generation register (EGR) */

#define ATIM_EGR_UG                    (1 << 0)                           /* Bit 0: Update Generation */
#define ATIM_EGR_CC1G                  (1 << 1)                           /* Bit 1: Capture/Compare 1 Generation */
#define ATIM_EGR_CC2G                  (1 << 2)                           /* Bit 2: Capture/Compare 2 Generation */
#define ATIM_EGR_CC3G                  (1 << 3)                           /* Bit 3: Capture/Compare 3 Generation */
#define ATIM_EGR_CC4G                  (1 << 4)                           /* Bit 4: Capture/Compare 4 Generation */
#define ATIM_EGR_COMG                  (1 << 5)                           /* Bit 5: Capture/Compare Control Update Generation */
#define ATIM_EGR_TG                    (1 << 6)                           /* Bit 6: Trigger Generation */
#define ATIM_EGR_BG                    (1 << 7)                           /* Bit 7: Break Generation */
#define ATIM_EGR_B2G                   (1 << 8)                           /* Bit 8: Break 2 Generation */

/* ATIM Capture/compare mode register 1 (CCMR1) - Output Compare Mode */

#define ATIM_CCMR1_CC1S_SHIFT          (0)                                /* Bits 0-1: Capture/Compare 1 Selection */
#define ATIM_CCMR1_CC1S_MASK           (3 << ATIM_CCMR1_CC1S_SHIFT)       /* (See common (unshifted) bit field definitions below) */
#define ATIM_CCMR1_OC1FE               (1 << 2)                           /* Bit 2: Output Compare 1 Fast enable */
#define ATIM_CCMR1_OC1PE               (1 << 3)                           /* Bit 3: Output Compare 1 Preload enable */
#define ATIM_CCMR1_OC1M_SHIFT          (4)                                /* Bits 4-6: Output Compare 1 Mode */
#define ATIM_CCMR1_OC1M_MASK           (7 << ATIM_CCMR1_OC1M_SHIFT)       /* (See common (unshifted) bit field definitions below) */
#define ATIM_CCMR1_OC1CE               (1 << 7)                           /* Bit 7: Output Compare 1Clear Enable */
#define ATIM_CCMR1_CC2S_SHIFT          (8)                                /* Bits 8-9: Capture/Compare 2 Selection */
#define ATIM_CCMR1_CC2S_MASK           (3 << ATIM_CCMR1_CC2S_SHIFT)       /* (See common (unshifted) bit field definitions below) */
#define ATIM_CCMR1_OC2FE               (1 << 10)                          /* Bit 10: Output Compare 2 Fast enable */
#define ATIM_CCMR1_OC2PE               (1 << 11)                          /* Bit 11: Output Compare 2 Preload enable */
#define ATIM_CCMR1_OC2M_SHIFT          (12)                               /* Bits 12-14: Output Compare 2 Mode */
#define ATIM_CCMR1_OC2M_MASK           (7 << ATIM_CCMR1_OC2M_SHIFT)       /* (See common (unshifted) bit field definitions below) */
#define ATIM_CCMR1_OC2CE               (1 << 15)                          /* Bit 15: Output Compare 2 Clear Enable */
#define ATIM_CCMR1_OC1M                (1 << 16)                          /* Bit 16: Output Compare 1 mode - bit 3 */
#define ATIM_CCMR1_OC2M                (1 << 24)                          /* Bit 24: Output Compare 2 mode - bit 3 */

/* ATIM Common CCMR (unshifted) Capture/Compare Selection
 * bit-field definitions
 */

