apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_tim_v3.h
#define ATIM_ECR_IE                    (1 << 0)                           /* Index enable (indicates if index resets counter): 0=no, 1=yes */
#define ATIM_ECR_IDIR_SHIFT            (1)                                /* Index direction */
#define ATIM_ECR_IDIR_MASK             (0x3 << ATIM_ECR_IDIR_SHIFT)
#  define ATIM_ECR_IDIR_BOTH           (0x0 << ATIM_ECR_IDIR_SHIFT)       /* Index resets the counter in both directions */
#  define ATIM_ECR_IDIR_UP             (0x1 << ATIM_ECR_IDIR_SHIFT)       /* Index resets the counter when counting up */
#  define ATIM_ECR_IDIR_DOWN           (0x2 << ATIM_ECR_IDIR_SHIFT)       /* Index resets the counter when counting down */
#define ATIM_ECR_FIDX                  (1 << 5)                           /* First index: 0=index always resets counter, 1=only first index resets counter */
#define ATIM_ECR_IPOS_SHIFT            (6)                                /* Index reset position */
#define ATIM_ECR_IPOS_MASK             (0x3 << ATIM_ECR_IPOS_SHIFT)
#  define ATIM_ECR_IPOS_00             (0x0 << ATIM_ECR_IPOS_SHIFT)       /* Index resets position when channels A,B = 0,0 */
#  define ATIM_ECR_IPOS_01             (0x1 << ATIM_ECR_IPOS_SHIFT)       /* Index resets position when channels A,B = 0,1 */
#  define ATIM_ECR_IPOS_10             (0x2 << ATIM_ECR_IPOS_SHIFT)       /* Index resets position when channels A,B = 1,0 */
#  define ATIM_ECR_IPOS_11             (0x3 << ATIM_ECR_IPOS_SHIFT)       /* Index resets position when channels A,B = 1,1 */
#define ATIM_ECR_PW_SHIFT              (16)                               /* Pulse duration in units of t[PWG], see ATIM_ECR_PWPRSC_MASK */
#define ATIM_ECR_PW_MASK               (0xff << ATIM_ECR_PW_SHIFT)
#define ATIM_ECR_PWPRSC_SHIFT          (24)                               /* Pulse width prescaler */
#define ATIM_ECR_PWPRSC_MASK           (0x7 << ATIM_ECR_PWPRSC_SHIFT)     /* t[PWG] = (2^(PWPRSC[2:0])) * t[tim_ker_ck] */

/* ATIM Timer input selection register (TISEL) */

#define ATIM_TISEL_TI1SEL_SHIFT        (0)
#define ATIM_TISEL_TI1SEL_MASK         (0xf << TIM_TISEL_TI1SEL_SHIFT)

#define ATIM_TISEL_TI2SEL_SHIFT        (8)
#define ATIM_TISEL_TI2SEL_MASK         (0xf << TIM_TISEL_TI2SEL_SHIFT)

#define ATIM_TISEL_TI3SEL_SHIFT        (16)
#define ATIM_TISEL_TI3SEL_MASK         (0xf << TIM_TISEL_TI3SEL_SHIFT)

#define ATIM_TISEL_TI4SEL_SHIFT        (24)
#define ATIM_TISEL_TI4SEL_MASK         (0xf << TIM_TISEL_TI4SEL_SHIFT)

/* ATIM Alternate function option register 1 (AF1) */

#define ATIM_AF1_BKINE                 (1 << 0)                           /* BRK BKIN input enable */
#define ATIM_AF1_BKCMP1E               (1 << 1)                           /* BRK COMP1 enable */
#define ATIM_AF1_BKCMP2E               (1 << 2)                           /* BRK COMP2 enable */
#define ATIM_AF1_BKCMP3E               (1 << 3)                           /* BRK COMP3 enable */
#define ATIM_AF1_BKCMP4E               (1 << 4)                           /* BRK COMP4 enable */
#define ATIM_AF1_BKCMP5E               (1 << 5)                           /* BRK COMP5 enable */
#define ATIM_AF1_BKCMP6E               (1 << 6)                           /* BRK COMP6 enable */
#define ATIM_AF1_BKCMP7E               (1 << 7)                           /* BRK COMP7 enable */
#define ATIM_AF1_BKINP                 (1 << 9)                           /* BRK BKIN input polarity */
#define ATIM_AF1_BKCMP1P               (1 << 10)                          /* BRK COMP1 input polarity */
#define ATIM_AF1_BKCMP2P               (1 << 11)                          /* BRK COMP2 input polarity */
#define ATIM_AF1_BKCMP3P               (1 << 12)                          /* BRK COMP3 input polarity */
#define ATIM_AF1_BKCMP4P               (1 << 13)                          /* BRK COMP4 input polarity */
#define ATIM_AF1_ETRSEL_SHIFT          (14)                               /* ETR source selection) */
#define ATIM_AF1_ETRSEL_MASK           (0xf << TIM1_AF1_ETRSEL_Pos)

/* ATIM Alternate function option register 2 (AF2) */

#define ATIM_AF2_BK2INE                (1 << 0)                           /* BRK2 BKIN input enable */
#define ATIM_AF2_BK2CMP1E              (1 << 1)                           /* BRK2 COMP1 enable */
#define ATIM_AF2_BK2CMP2E              (1 << 2)                           /* BRK2 COMP2 enable */
#define ATIM_AF2_BK2CMP3E              (1 << 3)                           /* BRK2 COMP3 enable */
#define ATIM_AF2_BK2CMP4E              (1 << 4)                           /* BRK2 COMP4 enable */
#define ATIM_AF2_BK2CMP5E              (1 << 5)                           /* BRK2 COMP5 enable */
#define ATIM_AF2_BK2CMP6E              (1 << 6)                           /* BRK2 COMP6 enable */
#define ATIM_AF2_BK2CMP7E              (1 << 7)                           /* BRK2 COMP7 enable */
#define ATIM_AF2_BK2INP                (1 << 9)                           /* BRK2 BKIN input polarity */
#define ATIM_AF2_BK2CMP1P              (1 << 10)                          /* BRK2 COMP1 input polarity */
#define ATIM_AF2_BK2CMP2P              (1 << 11)                          /* BRK2 COMP2 input polarity */
#define ATIM_AF2_BK2CMP3P              (1 << 12)                          /* BRK2 COMP3 input polarity */
#define ATIM_AF2_BK2CMP4P              (1 << 13)                          /* BRK2 COMP4 input polarity */
#define ATIM_AF2_OCRSEL_SHIFT          (16)                               /* ocref_clr source selection */
#define ATIM_AF2_OCRSEL_MASK           (0x7 << TIM1_AF2_OCRSEL_Pos)

/* ATIM DMA control register (DCR) */

#define ATIM_DCR_DBA_SHIFT             (0)                                /* Bits 0-4: DMA Base Address */
#define ATIM_DCR_DBA_MASK              (0x1f << ATIM_DCR_DBA_SHIFT)
#define ATIM_DCR_DBL_SHIFT             (8)                                /* Bits 8-12: DMA Burst Length */
#define ATIM_DCR_DBL_MASK              (0x1f << ATIM_DCR_DBL_SHIFT)
#  define ATIM_DCR_DBL(n)              (((n) - 1) << ATIM_DCR_DBL_SHIFT)  /* n transfers, n = 1..18 */

